# Excluded Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..Excluded Property
Part Class See Also
---
True if the part is excluded, false otherwise
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool Excluded { get; set; }
```

Visual Basic
---
```text
Public Property Excluded As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Excluded {
	bool get ();
	void set (bool value);
}
```

# See Also
Part Class
Autodesk.Revit.DB Namespace